app/controllers/bookmarklet_controller.rb

  def page_create
    user_key = params[:k]
    unsafe_title = CGI::unescape(params[:t])
    unsafe_url = CGI::unescape(params[:u])

    # JSON Response
    @response = { :completed=>false, :message=>"", :require_login=>false }

    # Start lookup, create the key if we have a user
    key = BookmarkletKey.find_or_initialize_by_value user_key

    unless key.valid?
      key.user = current_user
      unless current_user.nil? or key.save
---
SELECT `bookmarklet_keys`.id FROM `bookmarklet_keys` WHERE (`bookmarklet_keys`.`value` = BINARY 'cca5c91ff06158589386' AND `bookmarklet_keys`.id <> 1) LIMIT 1
INSERT INTO `bookmarklet_keys` (`created_at`, `updated_at`, `value`, `user_id`) VALUES('2010-09-05 06:32:28', '2010-09-05 06:32:28', 'cca5c91ff06158589386', 1)

      @response[:require_login] = true if current_user.nil?
    end

    if page and page.save
---
INSERT INTO `pages` (`thumbnail_small`, `shortened_url`, `like_count`, `slug`, `created_at`, `thumbnail_full`, `html_body`, `title`, `media_category`, `updated_at`, `source_url`, `thumbnail_full_height`, `is_cloaked`, `user_id`, `thumbnail_small_width`, `thumbnail_small_height`, `like_title`, `introduction`, `show_link`, `thumbnail_full_width`, `weighted_score`) VALUES('', '', 0, 'caution-this-is-batman-pic-7', '2010-09-06 08:06:48', 'http://s-ak.buzzfed.com/static/images/public/slideshow/contest.png', '<div><div href=\"http://www.reddit.com/r/pics/comments/d8gue/an_alternative_to_the_already_old_caution_this_is/\"> \n <p><img src=\"http://s-ak.buzzfed.com/static/imagebuzz/web03/2010/9/1/23/caution-this-is-batman-23443-1283399213-11.jpg\"></p>\n</div></div>', 'Caution: This. Is. BATMAN. [PIC]', NULL, '2010-09-06 08:06:48', 'http://www.buzzfeed.com/donnad/caution-this-is-batman-bif', 40, 0, 1, 0, 0, '', NULL, 1, 60, 0)