app/controllers/home_controller.rb

SELECT * FROM `pages` ORDER BY created_at DESC LIMIT 30
---
  def show
    @pages = Page.paginate :page=>params[:page], :order => 'weighted_score DESC', :include=>[:user], :conditions=>["like_count > 0 and show_in_popular=true"]