app/controllers/links_controller.rb

  def index
    @links = Link.all
---
SELECT * FROM `links`

  def show
    @link = Link.find(params[:id])
---
SELECT * FROM `links` WHERE (`links`.`id` = 2)

  def edit
    @link = Link.find(params[:id])
---
SELECT * FROM `links` WHERE (`links`.`id` = 1)

  def create
    @link = Link.new(params[:link])

    # Secure fields
    @link.user = current_user
    @link.like_count = 0

    unless @link.url.blank?
      # Get preview
      fill_in_link_using_url @link
    end

    if @link.save
---
INSERT INTO `links` (`like_count`, `created_at`, `title`, `updated_at`, `url`, `preview`) VALUES(0, '2010-08-21 02:50:29', 'This is a test link!', '2010-08-21 02:50:29', 'http://news.ycombinator.com', 'This is the link preview. Stuff will go here.')

  def update
    link = Link.find(params[:id])

    # Has permission?
    redirect_to root_path and return unless current_user == link.user or current_user.is_content_editor

    link.secure_update(params[:link], current_user)

    if link.save
---
SELECT * FROM `links` WHERE (`links`.`id` = 1)
UPDATE `links` SET `updated_at` = '2010-08-24 07:59:26', `title` = 'LikeLoft - Home edited' WHERE `id` = 1