app/controllers/page_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`id` = 2)
SELECT * FROM `pages` ORDER BY created_at DESC LIMIT 10
---
  def show
    @page = Page.find(params[:id])  # find automatically calls to_i
    # For ajax story loading
    @lower_five = Page.find :all, :select=>:id, :order=>"weighted_score DESC", :conditions=>["like_count > 0 AND weighted_score < ?", @page.weighted_score], :limit=>5

SELECT * FROM `pages` ORDER BY created_at DESC LIMIT 100
---
  def index
    @pages = Page.all(:order=>"created_at DESC", :limit=>100)

SELECT * FROM `pages` WHERE (`pages`.`id` = 12)
UPDATE `pages` SET `updated_at` = '2010-09-07 04:56:57', `html_body` = '<div><div href=\"http://imgur.com/jUvbF.jpg\"> \r\n <p><img src=\"http://s-ak.buzzfed.com/static/imagebuzz/terminal01/2010/8/30/12/kratos-from-god-of-war-gets-a-kitten-11987-1283186040-9.jpg\" width=\"560\" height=\"453\"></p>\r\n</div></div>', `title` = 'Kratos From God of War Gets a Kitten', `introduction` = 'Evil guy gets a kitten.', `media_category` = '' WHERE `id` = 11
---
  def update
    @page = Page.find(params[:id])

    unless current_user.is_content_editor or current_user == @page.user
      flash[:notice] = "You can't edit that page."
      redirect_to @page and return
    end

    # Default perms
    accept_fields = []
    update_values = {}

    if current_user.is_god
      accept_fields = Page::EDIT_PERMISSIONS[:god]
    elsif current_user.is_admin
      accept_fields = Page::EDIT_PERMISSIONS[:admin]
    elsif current_user.is_content_editor
      accept_fields = Page::EDIT_PERMISSIONS[:editor]
    elsif current_user
      accept_fields = Page::EDIT_PERMISSIONS[:owner]
    end

    params["page"].each do |key, value|
      update_values[key] = value if accept_fields.include? key
    end

    @page.update_attributes!(update_values)

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
DELETE FROM `pages` WHERE `id` = 1
---
  def destroy
    # TODO Soft delete
    @page = Page.find(params[:id])
    if current_user.is_content_editor or current_user == @page.user
      @page.destroy