app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 2)
---
  def show
    if params[:id].blank?
      redirect_to profile_path and return
    else
      @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `updated_at` = '2010-08-24 08:27:28', `facebook_id` = '904679' WHERE `id` = 1
---
  def update
    @user = User.find(params[:id])

    # Default perms
    accept_fields = []
    update_values = {}

    if current_user.is_god
      accept_fields = User.EDIT_PERMISSIONS[:god]
    elsif current_user.is_admin
      accept_fields = User.EDIT_PERMISSIONS[:admin]
    elsif current_user.is_content_editor
      accept_fields = User.EDIT_PERMISSIONS[:editor]
    elsif current_user == @user
      accept_fields = User.EDIT_PERMISSIONS[:owner]
    end

    params["user"].each do |key, value|
      update_values[key] = value if accept_fields.include? key
    end

    # Update
    @user.update_attributes!(update_values)